#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

//
////杨辉三角
//int main()
//{
//    #define n 10
// 	int arr[n][n] = { 0 };
//	int i = 0;
//	for (i = 0; i < n; i++) 
//	{
//		int j = 0;
//		arr[i][j] = 1; //把第一列和主对角线清零
//		j = i;
//		arr[i][j] = 1;
//
//		if (i >= 2 && j >= 1)//(优化) 从第三行以后的 每行的 第二个元素开始，这个元素等于上一行对应的那个元素
//		{					 // 加上上一行对应往左一个元素之和
//			for (j = 1; j <= i; j++)
//			{
//				arr[i][j] = arr[i - 1][j] + arr[i - 1][j - 1];
//			}
//		}
//	}
//
//	//for (i = 2; i < n; i++) // 从第三行以后的 每行的 第二个元素开始，这个元素等于上一行对应的那个元素
//	//{						// 加上上一行对应往左一个元素之和
//	//	int j = 0;
//	//	for (j = 1; j <=i; j++)
//	//	{
//	//		arr[i][j] = arr[i - 1][j] + arr[i - 1][j - 1];
//	//	}
//	//}
//
//	for (i = 0; i < n; i++) //打印
//	{
//		int j = 0;
//		for (j = 0; j < n - i; j++) // i行打印n-i个空格
//		{
//			putchar(' ');
//		}
//		for (j = 0; j <=i; j++) //打印杨辉三角
//		{
//			printf("%2d ",arr[i][j]);
//		}
//		putchar('\n');//打完一行后换行
//	}
//
//	return 0;
//}

//----------------------------------------------------------------------------------------------------------------------------------
//第7题（编程题)
// 题目名称:
//猜凶手//题目内容:
// 日本某地发生了一件谋杀案，警察通过排查确定杀人凶手必为4个嫌疑犯的一个。 
// 以下为4个嫌疑犯的供词:
// A说:不是我。
// B说:是C。
// c说:是D。 
// D说:c在胡说
// 已知3个人说了真话, 1个人说的是假话。 
// 现在请根据这些信息，写一个程序来确定到底谁是凶手
// 假设说真话是1，假话是0，则所有人的真假加起来等于3；

//int main()
//{
//	char Killer = 0;
//	for (Killer == 'A'; Killer <= 'D'; Killer++)
//	{
//		if (((Killer != 'A') + (Killer == 'C') + (Killer == 'D') + (Killer != 'D') == 3))
//		{
//			printf("killer is : %c", Killer);
//		}
//	}
//	
//	return 0;
//}
//---------------------------------------------------------------------------------------------------------------------------------


//跳水员的名次
//第8题(编程题)题目名称:
//猜名次题目内容:
//5位运动员参加了10米台跳水比赛，有人让他们预测比赛结果 :
//A选手说 : B第二，我第三;
//B选手说:我第二，E第四; 
//c选手说:我第一，D第二; 
//D选手说:C最后，我第三; 
//E选手说:我第四，A第一;
//比赛结束后，每位选手都说对了一半，请编程确定比赛的名次。
//
//int main()
//{
//	int A = 0;
//	int B = 0;
//	int C = 0;
//	int D = 0;
//	int E = 0;
//	for (A = 1; A <= 5; A++)
//	{
//		for (B = 1; B <= 5; B++)
//		{
//			for (C = 1; C <= 5; C++)
//			{
//				for (D = 1; D <= 5; D++)
//				{
//					for (E = 1; E <= 5; E++)
//					{
//						if (((B == 2) + (A == 3) == 1) &&
//							((B == 2) + (E == 4) == 1) &&
//							((C == 1) + (D == 2) == 1) &&
//							((C == 5) + (D == 3) == 1) &&
//							((E == 4) + (A == 1) == 1) )
//						{
//							if(A*B*C*D*E==120)
//							printf(" A: %d\n B: %d\n C: %d\n D: %d\n E: %d\n", A, B, C, D, E);
//						}
//					}
//				}
//			}
//		}
//	}
//	return 0;
//}
//---------------------------------------------------------------------------------------------------------------------------------

